In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
df = pd.read_csv("gdp.csv")
df.head()

  Country Name Country Code  Year         Value
0   Arab World          ARB  1968  2.576068e+10
1   Arab World          ARB  1969  2.843420e+10
2   Arab World          ARB  1970  3.138550e+10
3   Arab World          ARB  1971  3.642691e+10
4   Arab World          ARB  1972  4.331606e+10

In [3]:
df.nunique()

Country Name      256
Country Code      256
Year               57
Value           11398
dtype: int64

In [4]:
df.isna().sum()

Country Name    0
Country Code    0
Year            0
Value           0
dtype: int64

## Check Description of the Dataframe and its Columns

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11507 entries, 0 to 11506
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  11507 non-null  object
 1   Country Code  11507 non-null  object
 2   Year          11507 non-null  int64
 3   Value         11507 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 359.7+ KB

In [6]:
df.describe()

               Year         Value
count  11507.000000  1.150700e+04
mean    1991.265230  1.005972e+12
std       15.886648  4.533056e+12
min     1960.000000  8.824448e+06
25%     1978.000000  2.056874e+09
50%     1993.000000  1.436880e+10
75%     2005.000000  1.796394e+11
max     2016.000000  7.904923e+13

In [7]:
df["Country Name"].describe()

count                    11507
unique                     256
top       Hong Kong SAR, China
freq                        57
Name: Country Name, dtype: object

In [8]:
df["Country Code"].describe()

count     11507
unique      256
top         HKG
freq         57
Name: Country Code, dtype: object